import Image from "next/image";
import React from "react";

export default function Page() {
  return (
    <div className=" p-2 sm:p-8 2xl:container">
      <h1 className="lg:text-3xl text-xl font-bold mb-8 text-left">
        Bansawali Editor's Messages
      </h1>
      <div className="flex flex-col items-center mb-8   z-50">
        <Image
          className="rounded-lg w-[250px] h-[300px] sm:w-[300px] sm:h-[280px] object-cover"
          src="/dummy/boy.jpg"
          alt="literature collection"
          width={250}
          height={200}
        />
        <h2 className="text-xl font-semibold text-center">Rajesh Hamal</h2>
        <p className="text-gray-600 text-center">अध्यक्ष</p>
      </div>
      <div className="leading-relaxed  text-lg lg:w-[980px] w-full mx-auto  text-left">
        <p className="mb-4">
          क्रियाशीलता र रंगिनता भरपुर नेपाली संस्कृति र जीवन उत्सव। हाम्रो
          सामाजिक समृद्धता र सांस्कृतिक विविधतामा गहिरो नाटिकले फैलिएको छ।
          नेपाली लोकसंस्कृति अनेक रंग र स्वादमा समृद्ध छ, जुन सार्वजनिक र
          प्राइभेट अवस्थामा पाईन्छ। यसले हाम्रो समाजलाई अन्याय, समर्थन, र
          सामूहिकता भर्खरै प्रदान गर्दछ।
        </p>
        <p className="mb-4">
          नेपाली साहित्य, कला, संगीत, नृत्य, वस्त्र, र भोजनसमेत नेपालको
          सांस्कृतिक धरोहरको एक महत्त्वपूर्ण हिस्सा हुन्। त्यस्तो धेरै विविधताले
          हाम्रो देशलाई अनूठो र अत्यन्त प्रिय बनाएको छ। धार्मिक र सांस्कृतिक
          अवस्थामा, हाम्रो समाजले धेरै प्राचीन परंपराहरू आदर्श रुपमा बनाएको छ।
        </p>
        <p className="mb-4">
          नेपाली साहित्य र भाषा प्राय: हाम्रो भाषा, संस्कृतिक धारणा, र रहेका
          ऐतिहासिक घटनाहरूको विस्तृत प्रतिबिम्ब हो। यसले हाम्रो समुदायको
          संस्कृतिक गहिरोता, ज्ञान, र विचारलाई प्रकट गर्दछ।
        </p>
        <p>
          धेरै तालिकाहरू, रितुअनुसार उत्सव, उत्सव, तथा पर्वहरू भागी नेपालमा
          आयोजित हुन्छन्। यी आयोजनहरू नेपाली सांस्कृतिक परंपरा र धार्मिक उत्सवमा
          सहायक छन्। यसले नेपाली जीवनको निरन्तरता र समृद्धताको प्रतिष्ठा गर्दछ।
          प्रथम, नेपाली संस्कृतिको विविधता र समृद्धतामा संगीत, नृत्य, र कला
          जस्ता अनेक आदानप्रदानहरू भरिएका छन्। यसले नेपाली समुदायलाई समृद्ध
          भावना, सांस्कृतिक सहभागिता, र सामूहिक अभिवृद्धि साधन गर्दछ।
        </p>
      </div>
    </div>
  );
}
