import React from "react";

export default function Page() {
  return (
    <div className="2xl:container mx-auto px-2 sm:px-8 py-16">
      <div className="flex flex-col  lg:flex-row mb-8 items-center lg:items-start justify-center lg:justify-start">
        <div className="text-center lg:sticky lg:top-20  lg:text-left lg:ml-8 ">
          <div className="float-left mr-4 mb-8">
            <img
              src="/dummy/mygirl.jpg"
              alt="literature collection"
              width={200}
              height={200}
              className=" w-[200px] h-[200px] sm:w-[300px] sm:h-[300px]  object-cover  rounded-full"
            />
          </div>
          <h1 className="text-3xl font-bold mt-6 mb-2 lg:text-center  ">
            रोनिशा थापा
          </h1>
          <p className="text-gray-600  lg:text-center">2024-05-10</p>
        </div>
        <div className="w-full mt-4 sm:ml-8 ml-0  sm:mt-0 lg:w-[450px] leading-relaxed md:w-[400px] sm:w-[400px]  rounded  text-center text-lg  bg-white p-4">
          <p className="leading-relaxed">
            नेपालको मनमा, धरतीमा, इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
            परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको। युगोंको सिरानोमा,
            जातिले राज्य गर्यो स्वायत्त, जीवनलाई आफ्नो रूपमा आकार दियो,
            तारारोपमा समयको चक्कर पर्खे, नयाँ कथाहरू आउँछन्, नयाँ सत्यहरू
            खुल्छन्। पहाड़बाट तराईसम्म, उत्तरदेखि दक्षिणसम्म, जातिको प्रभाव
            फैलिएको छ चारो तिर, तर उसको छायामा, उसको नजरमा, परिवर्तनको आत्मा छ,
            सूर्यको ब्यान्डमा। क्योंकि नेपालको इतिहासको गहिरो भित्र, समृद्धताको
            खोजी, न्यायको निर्देशन। जातीय विविधतामा, एकतामा सहारा पाइ, हरेक
            आत्मा, चाहे जाति भए वा नभए, मिल्छ एकता मा आत्म-विश्वास, मिल्छ शक्ति
            जब भए । त्यसैले हाम्रो अत्ती, पुरानो गलियोमा, तालाबारी, भविष्यको
            खोजी, नयाँ श्रृंगार नै पाइ, किनकि नेपालको कथा, जातिले छायामा छ, तर
            एकतामा हाम्रो भविष्य रहेछ पनि यहाँ।
            <br />
            नेपालको मनमा, धरतीमा, इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
            परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको। युगोंको सिरानोमा,
            जातिले राज्य गर्यो स्वायत्त, जीवनलाई आफ्नो रूपमा आकार दियो,
            तारारोपमा समयको चक्कर पर्खे, नयाँ कथाहरू आउँछन्, नयाँ सत्यहरू
            खुल्छन्। पहाड़बाट तराईसम्म, उत्तरदेखि दक्षिणसम्म, जातिको प्रभाव
            फैलिएको छ चारो तिर, तर उसको छायामा, उसको नजरमा, परिवर्तनको आत्मा छ,
            सूर्यको ब्यान्डमा। क्योंकि नेपालको इतिहासको गहिरो भित्र, समृद्धताको
            खोजी, न्यायको निर्देशन। जातीय विविधतामा, एकतामा सहारा पाइ, हरेक
            आत्मा, चाहे जाति भए वा नभए, मिल्छ एकता मा आत्म-विश्वास, मिल्छ शक्ति
            जब भए । त्यसैले हाम्रो अत्ती, पुरानो गलियोमा, तालाबारी, भविष्यको
            खोजी, नयाँ श्रृंगार नै पाइ, किनकि नेपालको कथा, जातिले छायामा छ, तर
            एकतामा हाम्रो भविष्य रहेछ पनि यहाँ।
            <br />
            नेपालको मनमा, धरतीमा, इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
            परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको। युगोंको सिरानोमा,
            जातिले राज्य गर्यो स्वायत्त, जीवनलाई आफ्नो रूपमा आकार दियो,
            तारारोपमा समयको चक्कर पर्खे, नयाँ कथाहरू आउँछन्, नयाँ सत्यहरू
            खुल्छन्। पहाड़बाट तराईसम्म, उत्तरदेखि दक्षिणसम्म, जातिको प्रभाव
            फैलिएको छ चारो तिर, तर उसको छायामा, उसको नजरमा, परिवर्तनको आत्मा छ,
            सूर्यको ब्यान्डमा। क्योंकि नेपालको इतिहासको गहिरो भित्र, समृद्धताको
            खोजी, न्यायको निर्देशन। जातीय विविधतामा, एकतामा सहारा पाइ, हरेक
            आत्मा, चाहे जाति भए वा नभए, मिल्छ एकता मा आत्म-विश्वास, मिल्छ शक्ति
            जब भए । त्यसैले हाम्रो अत्ती, पुरानो गलियोमा, तालाबारी, भविष्यको
            खोजी, नयाँ श्रृंगार नै पाइ, किनकि नेपालको कथा, जातिले छायामा छ, तर
            एकतामा हाम्रो भविष्य रहेछ पनि यहाँ।
          </p>
        </div>
      </div>
    </div>
  );
}
